<?xml version="1.0" encoding="UTF-8"?>
<response>
  <status>success</status>
  <result>
    <project>
      <id>339700</id>
      <name>ck-scripts</name>
      <url>http://www.ohloh.net/p/ck-scripts.xml</url>
      <html_url>http://www.ohloh.net/p/ck-scripts</html_url>
      <created_at>2009-05-10T03:09:31Z</created_at>
      <updated_at>2013-07-06T16:15:10Z</updated_at>
      <description>Scripts for eggdrop library ck.lib. My own and modified official. 

Bad english, lol. 



Russian&#1048;&#1090;&#1072;&#1082;. &#1069;&#1090;&#1086; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; &#1076;&#1083;&#1103; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086;&#1076; ck.lib (&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090;). &#1056;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1103; &#1079;&#1076;&#1077;&#1089;&#1100; &#1073;&#1091;&#1076;&#1091; &#1082;&#1072;&#1082; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1090;&#1072;&#1082; &#1080; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1084;&#1085;&#1086;&#1081; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;. &#1040; &#1077;&#1089;&#1083;&#1080; &#1082;&#1090;&#1086; &#1087;&#1088;&#1080;&#1096;&#1083;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; &#1085;&#1072; e-mail kns@xtmb.info, &#1090;&#1086; &#1089; &#1088;&#1072;&#1076;&#1086;&#1089;&#1090;&#1100;&#1102; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1102; &#1077;&#1075;&#1086; &#1074; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081;. 



&#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103;&#1057;&#1088;&#1072;&#1079;&#1091; &#1089;&#1082;&#1072;&#1078;&#1091;, &#1095;&#1090;&#1086; &#1074; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103;&#1093; &#1085;&#1077; &#1088;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072;&#1102;&#1089;&#1100;, &#1085;&#1086;, &#1090;.&#1082;. &#1087;&#1091;&#1085;&#1082;&#1090; &#1101;&#1090;&#1086; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081;, &#1087;&#1088;&#1080;&#1096;&#1083;&#1086;&#1089;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1086;&#1077; &#1087;&#1086; &#1079;&#1074;&#1091;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1063;&#1077;&#1088;&#1077;&#1079; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1091; &#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086;&#1073; &#1072;&#1074;&#1090;&#1086;&#1088;&#1072;&#1093; &#1074; &#1074;&#1099;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1072;&#1093; &#1080; &#1086;&#1087;&#1080;&#1096;&#1091; &#1089;&#1074;&#1086;&#1081; &#1074;&#1079;&#1075;&#1083;&#1103;&#1076; &#1085;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;. 

&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074;http://code.google.com/p/ck-scripts/source/browse/trunk 

&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1095;&#1080;&#1082;&#1059;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1095;&#1080;&#1082; &#1076;&#1083;&#1103; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; - loader.tcl. &#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;.</description>
      <homepage_url>http://code.google.com/p/ck-scripts</homepage_url>
      <download_url></download_url>
      <url_name>ck-scripts</url_name>
      <medium_logo_url>no_logo.png</medium_logo_url>
      <small_logo_url>no_logo_32.png</small_logo_url>
      <user_count>1</user_count>
      <average_rating></average_rating>
      <rating_count>0</rating_count>
      <review_count>0</review_count>
      <analysis_id>14551955</analysis_id>
      <tags>
        <tag>scripts</tag>
        <tag>eggdrop</tag>
        <tag>tcl</tag>
        <tag>cklib</tag>
      </tags>
      <analysis>
        <id>14551955</id>
        <url>http://www.ohloh.net/analyses/14551955.xml</url>
        <project_id>339700</project_id>
        <updated_at>2013-07-20T17:06:15Z</updated_at>
        <logged_at>2013-07-20T17:06:12Z</logged_at>
        <min_month>2009-03-01T00:00:00Z</min_month>
        <max_month>2011-08-01T00:00:00Z</max_month>
        <twelve_month_contributor_count>0</twelve_month_contributor_count>
        <total_code_lines>3238</total_code_lines>
        <factoids>
          <factoid type="FactoidAgeEstablished">
Young, but established codebase          </factoid>
          <factoid type="FactoidActivityDecreasing">
Decreasing Y-O-Y development activity          </factoid>
          <factoid type="FactoidCommentsVeryLow">
Very few source code comments          </factoid>
          <factoid type="FactoidTeamSizeZero">
No recent development activity          </factoid>
        </factoids>
        <languages graph_url="http://www.ohloh.net/p/ck-scripts/analyses/14551955/languages.png">
          <language color="D290A8" percentage="100" id="25">
Tcl          </language>
        </languages>
        <main_language_id>25</main_language_id>
        <main_language_name>Tcl</main_language_name>
      </analysis>
      <licenses>
        <license>
          <name>gpl3_or_later</name>
          <nice_name>GNU General Public License v3.0 or later</nice_name>
        </license>
      </licenses>
    </project>
  </result>
</response>
