<?xml version="1.0" encoding="UTF-8"?>
<response>
  <status>success</status>
  <result>
    <project>
      <id>456348</id>
      <name>s7graphview</name>
      <url>http://www.ohloh.net/p/s7graphview.xml</url>
      <html_url>http://www.ohloh.net/p/s7graphview</html_url>
      <created_at>2009-09-29T21:07:29Z</created_at>
      <updated_at>2012-05-09T12:28:20Z</updated_at>
      <description>(Click on the image to watch the video) 

Many thanks to habrauser snobit for sharing his sources for GraphView, the Cocoa component that served as the basis for S7GraphView. 
&#1042;&#1099;&#1088;&#1072;&#1078;&#1072;&#1102; &#1089;&#1074;&#1086;&#1102; &#1080;&#1089;&#1082;&#1088;&#1077;&#1085;&#1085;&#1102;&#1102; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1085;&#1086;&#1089;&#1090;&#1100; &#1093;&#1072;&#1073;&#1088;&#1072;&#1102;&#1079;&#1077;&#1088;&#1091; snobit &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074; &#1076;&#1083;&#1103; GraphView - Cocoa &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1089;&#1083;&#1091;&#1078;&#1080;&#1083; &#1086;&#1089;&#1085;&#1086;&#1074;&#1086;&#1081; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; S7GraphView. 
FeaturesCan change background color, grid line colors as well as regulate their visibility, axis text colors. Can display information text above the graph. You can set its color as well. Can display one or several graphs at a time. Easy to customize text for axis. Half-automatic logic. Using the ComponentIf you have a decent experience with UITableView or any other Cocoa Touch component that takes its data via a data-source, it will be easy for you to catch up with S7GraphView since it supports that ideology too. 

For instructions on how to throw in the component to your project, please, refer to my another initiative - s7ratingview. I will go straight to code now. 

N.B. In time the instructions will be much more verbose, but this is all I have time to squeeze out for now. 

First you need to include a proper import. Open your *.h file: 

#import &quot;S7GraphView.h&quot;Now let the compiler know you are going to implement S7GraphViewDataSource protocol: 

@interface MainViewController : UIViewController {
}
...
@endGo to the associated *.m file and implement the methods S7GraphViewDataSource requires: 

- (NSUInteger)graphViewNumberOfPlots:(S7GraphView *)graphView {
/* Return the number of plots you are going to have in the view. 1+ */
}

- (NSArray *)graphViewXValues:(S7GraphView *)graphView {
/* An array of objects that will be further formatted to be displayed on the X-axis.
   The number of elements should be equal to the number of points you have for every plot. */
}

- (NSArray *)graphView:(S7GraphView *)graphView yValuesForPlot:(NSUInteger)plotIndex {
/* Return the values for a specific graph. Each plot is meant to have equal number of points.
   And this amount should be equal to the amount of elements you return from graphViewXValues: method. */
}Optionally you can implement this method as well: 

- (BOOL)graphView:(S7GraphView *)graphView shouldFillPlot:(NSUInteger)plotIndex;It explains the graph-view which graph should be rendered with filled space below it. Usually you'll want it to be the plot with index = 0 to not overlap other plots. 

N.B. In the future revision it is very possible that the fill color will be customizable. 

For example in viewDidLoad method add such initialization (it was used to create the graph in the video): 

NSNumberFormatter *numberFormatter = [NSNumberFormatter new];
[numberFormatter setNumberStyle:NSNumberFormatterDecimalStyle];
[numberFormatter setMinimumFractionDigits:0];
[numberFormatter setMaximumFractionDigits:0];
	
self.graphView.yValuesFormatter = numberFormatter;

NSDateFormatter *dateFormatter = [NSDateFormatter new];
[dateFormatter setTimeStyle:NSDateFormatterNoStyle];
[dateFormatter setDateStyle:NSDateFormatterShortStyle];
	
self.graphView.xValuesFormatter = dateFormatter;
	
[dateFormatter release];	
[numberFormatter release];

self.graphView.backgroundColor = [UIColor blackColor];
	
self.graphView.drawAxisX = YES;
self.graphView.drawAxisY = YES;
self.graphView.drawGridX = YES;
self.graphView.drawGridY = YES;
	
self.graphView.xValuesColor = [UIColor whiteColor];
self.graphView.yValuesColor = [UIColor whiteColor];
	
self.graphView.gridXColor = [UIColor whiteColor];
self.graphView.gridYColor = [UIColor whiteColor];
	
self.graphView.drawInfo = NO;
self.graphView.info = @&quot;Load&quot;;
self.graphView.infoColor = [UIColor whiteColor];When you need to update the data, make this call: 

[self.graphView reloadData];&#1052;&#1072;&#1078;&#1083;&#1110;&#1074;&#1072;&#1089;&#1094;&#1110;&#1052;&#1086;&#1078;&#1072; &#1079;&#1084;&#1103;&#1085;&#1103;&#1094;&#1100; &#1082;&#1086;&#1083;&#1077;&#1088; &#1090;&#1083;&#1091;, &#1082;&#1086;&#1083;&#1077;&#1088; &#1083;&#1110;&#1085;&#1110;&#1103;&#1118; &#1089;&#1077;&#1090;&#1082;&#1110; &#1103;&#1082; &#1110; &#1110;&#1093; &#1073;&#1072;&#1095;&#1085;&#1072;&#1089;&#1094;&#1100;, &#1082;&#1086;&#1083;&#1077;&#1088; &#1090;&#1101;&#1082;&#1089;&#1090;&#1091; &#1087;&#1086;&#1076;&#1087;&#1110;&#1089;&#1072;&#1118; &#1085;&#1072; &#1074;&#1086;&#1089;&#1103;&#1093; &#1082;&#1086;&#1086;&#1088;&#1076;&#1099;&#1085;&#1072;&#1090;&#1072;&#1118;. &#1052;&#1086;&#1078;&#1072; &#1072;&#1076;&#1083;&#1102;&#1089;&#1090;&#1088;&#1086;&#1118;&#1074;&#1072;&#1094;&#1100; &#1110;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1099;&#1081;&#1085;&#1099; &#1090;&#1101;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076; &#1075;&#1088;&#1072;&#1092;&#1110;&#1082;&#1072;&#1084;. &#1042;&#1099; &#1090;&#1072;&#1082;&#1089;&#1072;&#1084;&#1072; &#1084;&#1086;&#1078;&#1072;&#1094;&#1077; &#1118;&#1089;&#1090;&#1072;&#1083;&#1103;&#1074;&#1072;&#1094;&#1100; &#1103;&#1075;&#1086;&#1085;&#1099; &#1082;&#1086;&#1083;&#1077;&#1088;. &#1052;&#1086;&#1078;&#1072; &#1072;&#1076;&#1083;&#1102;&#1089;&#1090;&#1088;&#1086;&#1118;&#1074;&#1072;&#1094;&#1100; &#1072;&#1076;&#1079;&#1110;&#1085; &#1094;&#1110; &#1085;&#1077;&#1082;&#1072;&#1083;&#1100;&#1082;&#1110; &#1075;&#1088;&#1072;&#1092;&#1110;&#1082;&#1072;&#1118; &#1072;&#1076;&#1085;&#1072;&#1095;&#1072;&#1089;&#1086;&#1074;&#1072;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1072; &#1082;&#1072;&#1089;&#1090;&#1086;&#1084;&#1072;&#1081;&#1079;&#1110;&#1094;&#1100; &#1090;&#1101;&#1082;&#1089;&#1090; &#1087;&#1086;&#1076;&#1087;&#1110;&#1089;&#1072;&#1118; &#1085;&#1072; &#1074;&#1086;&#1089;&#1103;&#1093; &#1082;&#1086;&#1086;&#1088;&#1076;&#1099;&#1085;&#1072;&#1090;&#1072;&#1118;. &#1053;&#1072;&#1087;&#1072;&#1118;&#1072;&#1118;&#1090;&#1072;&#1084;&#1072;&#1090;&#1099;&#1095;&#1085;&#1072;&#1103; &#1083;&#1105;&#1075;&#1110;&#1082;&#1072;. &#1059;&#1078;&#1099;&#1074;&#1072;&#1085;&#1085;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1101;&#1085;&#1090;&#1091;&#1050;&#1072;&#1083;&#1110; &#1074;&#1099; &#1084;&#1072;&#1077;&#1094;&#1077; &#1073;&#1072;&#1075;&#1072;&#1090;&#1072; &#1076;&#1086;&#1089;&#1074;&#1077;&#1076;&#1091; &#1079; UITableView &#1094;&#1110; &#1083;&#1102;&#1073;&#1099;&#1084; &#1110;&#1085;&#1096;&#1099;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1101;&#1085;&#1090;&#1072;&#1084; Cocoa Touch, &#1082;&#1072;&#1090;&#1086;&#1088;&#1099; &#1072;&#1090;&#1088;&#1099;&#1084;&#1086;&#1118;&#1074;&#1072;&#1077; &#1076;&#1072;&#1076;&#1079;&#1077;&#1085;&#1099;&#1103; &#1079; data-source, &#1074;&#1072;&#1084; &#1073;&#1091;&#1076;&#1079;&#1077; &#1083;&#1105;&#1075;&#1082;&#1072; &#1087;&#1072;&#1095;&#1072;&#1094;&#1100; &#1087;&#1088;&#1072;&#1094;&#1072;&#1074;&#1072;&#1094;&#1100; &#1110; &#1079; S7GraphView, &#1073;&#1086; &#1090;&#1086;&#1081; &#1087;&#1072;&#1076;&#1090;&#1088;&#1099;&#1084;&#1086;&#1118;&#1074;&#1072;&#1077; &#1090;&#1091;&#1102;-&#1078; &#1089;&#1072;&#1084;&#1091;&#1102; &#1110;&#1076;&#1101;&#1086;&#1083;&#1105;&#1075;&#1110;&#1102;. 

&#1047;&#1072; &#1110;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1099;&#1103;&#1084;&#1110; &#1087;&#1072; &#1090;&#1099;&#1084;, &#1103;&#1082; &#1091;&#1082;&#1110;&#1085;&#1091;&#1094;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1101;&#1085;&#1090; &#1091; &#1074;&#1072;&#1096;&#1099; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1079;&#1074;&#1103;&#1088;&#1090;&#1072;&#1081;&#1094;&#1077;&#1089;&#1103;, &#1082;&#1072;&#1083;&#1110; &#1083;&#1072;&#1089;&#1082;&#1072;, &#1076;&#1072; &#1084;&#1072;&#1105;&#1081; &#1110;&#1085;&#1096;&#1072;&#1081; &#1110;&#1085;&#1110;&#1094;&#1099;&#1103;&#1090;&#1099;&#1074;&#1099; - s7ratingview. &#1047;&#1072;&#1088;&#1072;&#1079;-&#1078;&#1072; &#1103; &#1072;&#1076;&#1088;&#1072;&#1079;&#1091; &#1087;&#1077;&#1088;&#1072;&#1081;&#1076;&#1091; &#1076;&#1072; &#1082;&#1086;&#1076;&#1091;. 

N.B. &#1047; &#1094;&#1103;&#1075;&#1072;&#1084; &#1095;&#1072;&#1089;&#1091; &#1110;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1099;&#1110; &#1089;&#1090;&#1072;&#1085;&#1091;&#1094;&#1100; &#1087;&#1072;&#1076;&#1088;&#1072;&#1073;&#1103;&#1079;&#1085;&#1077;&#1081;&#1096;&#1099;&#1084;&#1110;, &#1072;&#1083;&#1077; &#1087;&#1072;&#1082;&#1091;&#1083;&#1100; &#1075;&#1101;&#1090;&#1072; &#1118;&#1089;&#1105;, &#1096;&#1090;&#1086; &#1103; &#1079;&#1084;&#1086;&#1075; &#1079; &#1089;&#1103;&#1073;&#1077; &#1074;&#1099;&#1094;&#1110;&#1089;&#1085;&#1091;&#1094;&#1100; &#1087;&#1088;&#1072;&#1079; &#1085;&#1103;&#1089;&#1090;&#1072;&#1095;&#1091; &#1095;&#1072;&#1089;&#1091;. 

&#1057;&#1087;&#1103;&#1088;&#1096;&#1072; &#1090;&#1088;&#1101; &#1118;&#1090;&#1086;&#1095;&#1099;&#1094;&#1100; &#1087;&#1088;&#1072;&#1074;&#1110;&#1083;&#1100;&#1085;&#1099; import. &#1040;&#1076;&#1082;&#1088;&#1099;&#1081;&#1094;&#1077; &#1089;&#1074;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083; *.h &#1110; &#1076;&#1072;&#1076;&#1072;&#1081;&#1094;&#1077;: 

#import &quot;S7GraphView.h&quot;&#1062;&#1103;&#1087;&#1077;&#1088; &#1076;&#1072;&#1081;&#1094;&#1077; &#1082;&#1086;&#1084;&#1087;&#1110;&#1083;&#1103;&#1090;&#1072;&#1088;&#1091; &#1079;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1094;&#1100;, &#1096;&#1090;&#1086; &#1074;&#1099; &#1079;&#1073;&#1110;&#1088;&#1072;&#1077;&#1094;&#1077;&#1089;&#1103; &#1088;&#1101;&#1072;&#1083;&#1110;&#1079;&#1072;&#1074;&#1072;&#1094;&#1100; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083; S7GraphViewDataSource: 

@interface MainViewController : UIViewController {
}
...
@end&#1055;&#1077;&#1088;&#1072;&#1083;&#1091;&#1095;&#1099;&#1094;&#1077;&#1089;&#1103; &#1085;&#1072; &#1072;&#1076;&#1087;&#1072;&#1074;&#1077;&#1076;&#1085;&#1099; &#1092;&#1072;&#1081;&#1083; *.m &#1110; &#1088;&#1101;&#1072;&#1083;&#1110;&#1079;&#1091;&#1081;&#1094;&#1077; &#1084;&#1101;&#1090;&#1086;&#1076;&#1099;, &#1087;&#1072;&#1090;&#1088;&#1072;&#1073;&#1072;&#1074;&#1072;&#1085;&#1099;&#1103; S7GraphViewDataSource: 

- (NSUInteger)graphViewNumberOfPlots:(S7GraphView *)graphView {
/* &#1042;&#1103;&#1088;&#1085;&#1110;&#1094;&#1077; &#1082;&#1086;&#1083;&#1100;&#1082;&#1072;&#1089;&#1094;&#1100; &#1075;&#1088;&#1072;&#1092;&#1110;&#1082;&#1072;&#1118;, &#1082;&#1072;&#1090;&#1086;&#1088;&#1099;&#1103; &#1084;&#1072;&#1102;&#1094;&#1100; &#1073;&#1099;&#1094;&#1100; &#1072;&#1076;&#1083;&#1102;&#1089;&#1090;&#1088;&#1072;&#1074;&#1072;&#1085;&#1099;&#1103; &#1118; view. 1+ */
}

- (NSArray *)graphViewXValues:(S7GraphView *)graphView {
/* &#1052;&#1072;&#1089;&#1089;&#1099;&#1118; &#1086;&#1073;'&#1077;&#1082;&#1090;&#1072;&#1118;, &#1082;&#1072;&#1090;&#1086;&#1088;&#1099;&#1103; &#1087;&#1072;&#1079;&#1085;&#1077;&#1081; &#1073;&#1091;&#1076;&#1091;&#1094;&#1100; &#1089;&#1092;&#1072;&#1088;&#1084;&#1072;&#1090;&#1072;&#1074;&#1072;&#1085;&#1099;&#1103;, &#1082;&#1072;&#1073; &#1073;&#1099;&#1094;&#1100; &#1072;&#1076;&#1083;&#1102;&#1089;&#1090;&#1088;&#1072;&#1074;&#1072;&#1085;&#1099;&#1084;&#1110; &#1085;&#1072; &#1074;&#1086;&#1089;&#1110; X.
   &#1050;&#1086;&#1083;&#1100;&#1082;&#1072;&#1089;&#1094;&#1100; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1118; &#1084;&#1072;&#1077; &#1073;&#1099;&#1094;&#1100; &#1088;&#1086;&#1118;&#1085;&#1072;&#1103; &#1082;&#1086;&#1083;&#1100;&#1082;&#1072;&#1089;&#1094;&#1110; &#1082;&#1088;&#1086;&#1087;&#1072;&#1082; &#1091; &#1082;&#1086;&#1078;&#1085;&#1099;&#1084; &#1075;&#1088;&#1072;&#1092;&#1110;&#1082;&#1091;.
 */
}

- (NSArray *)graphView:(S7GraphView *)graphView yValuesForPlot:(NSUInteger)plotIndex {
/* &#1042;&#1103;&#1088;&#1085;&#1110;&#1094;&#1077; &#1079;&#1085;&#1072;&#1095;&#1072;&#1085;&#1085;&#1110; &#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1082;&#1088;&#1101;&#1090;&#1085;&#1072;&#1075;&#1072; &#1075;&#1088;&#1072;&#1092;&#1110;&#1082;&#1091;. &#1052;&#1072;&#1077;&#1094;&#1094;&#1072; &#1085;&#1072; &#1118;&#1074;&#1072;&#1079;&#1077;, &#1096;&#1090;&#1086; &#1082;&#1086;&#1078;&#1085;&#1099; &#1075;&#1088;&#1072;&#1092;&#1110;&#1082; &#1073;&#1091;&#1076;&#1079;&#1077; &#1084;&#1077;&#1094;&#1100; &#1072;&#1076;&#1085;&#1086;&#1083;&#1100;&#1082;&#1072;&#1074;&#1091;&#1102; &#1082;&#1086;&#1083;&#1100;&#1082;&#1072;&#1089;&#1094;&#1100; &#1082;&#1088;&#1086;&#1087;&#1072;&#1082;. 
   &#1030; &#1075;&#1101;&#1090;&#1072;&#1103; &#1082;&#1086;&#1083;&#1100;&#1082;&#1072;&#1089;&#1094;&#1100; &#1084;&#1072;&#1077; &#1073;&#1099;&#1094;&#1100; &#1088;&#1086;&#1118;&#1085;&#1072;&#1081; &#1082;&#1086;&#1083;&#1100;&#1082;&#1072;&#1089;&#1094;&#1110; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1118;, &#1082;&#1072;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099; &#1074;&#1103;&#1088;&#1090;&#1072;&#1077;&#1094;&#1077; &#1079; &#1084;&#1101;&#1090;&#1086;&#1076;&#1091; graphViewXValues:.
}&#1054;&#1087;&#1094;&#1099;&#1103;&#1085;&#1072;&#1083;&#1100;&#1085;&#1072; &#1074;&#1099; &#1084;&#1086;&#1078;&#1072;&#1094;&#1077; &#1090;&#1072;&#1082;&#1089;&#1072;&#1084;&#1072; &#1088;&#1101;&#1072;&#1083;&#1110;&#1079;&#1072;&#1074;&#1072;&#1094;&#1100; &#1085;&#1072;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1084;&#1101;&#1090;&#1086;&#1076;: 

- (BOOL)graphView:(S7GraphView *)graphView shouldFillPlot:(NSUInteger)plotIndex;&#1043;&#1101;&#1090;&#1072;&#1082; &#1074;&#1099; &#1090;&#1083;&#1091;&#1084;&#1072;&#1095;&#1099;&#1094;&#1077; graph-view, &#1103;&#1082;&#1110; &#1075;&#1088;&#1072;&#1092;&#1110;&#1082; &#1084;&#1072;&#1077; &#1073;&#1099;&#1094;&#1100; &#1072;&#1076;&#1083;&#1102;&#1089;&#1090;&#1088;&#1072;&#1074;&#1072;&#1085;&#1099; &#1079; &#1079;&#1072;&#1087;&#1086;&#1118;&#1085;&#1077;&#1085;&#1085;&#1072;&#1081; &#1087;&#1072;&#1076; &#1110;&#1084; &#1074;&#1086;&#1073;&#1083;&#1072;&#1089;&#1094;&#1102;. &#1047;&#1074;&#1099;&#1095;&#1072;&#1081;&#1085;&#1072; &#1075;&#1101;&#1090;&#1072; &#1073;&#1091;&#1076;&#1079;&#1077; &#1075;&#1088;&#1072;&#1092;&#1110;&#1082; &#1079; index = 0, &#1082;&#1072;&#1073; &#1085;&#1077; &#1087;&#1077;&#1088;&#1072;&#1082;&#1088;&#1099;&#1094;&#1100; &#1072;&#1089;&#1090;&#1072;&#1090;&#1085;&#1110;&#1093; &#1075;&#1088;&#1072;&#1092;&#1110;&#1082;&#1072;&#1118;. 

N.B. &#1059; &#1073;&#1091;&#1076;&#1091;&#1095;&#1099;&#1093; &#1088;&#1101;&#1074;&#1110;&#1079;&#1110;&#1103;&#1093; &#1094;&#1072;&#1083;&#1082;&#1072;&#1084; &#1084;&#1072;&#1078;&#1083;&#1110;&#1074;&#1072;, &#1096;&#1090;&#1086; &#1082;&#1086;&#1083;&#1077;&#1088; &#1079;&#1072;&#1087;&#1072;&#1118;&#1085;&#1077;&#1085;&#1085;&#1103; &#1084;&#1086;&#1078;&#1085;&#1072; &#1073;&#1091;&#1076;&#1079;&#1077; &#1079;&#1084;&#1103;&#1085;&#1103;&#1094;&#1100;. 

&#1055;&#1088;&#1099;&#1082;&#1083;&#1072;&#1076;&#1072;&#1084;, &#1091; &#1084;&#1101;&#1090;&#1086;&#1076;&#1079;&#1077; viewDidLoad &#1084;&#1086;&#1078;&#1072;&#1094;&#1077; &#1076;&#1072;&#1076;&#1072;&#1094;&#1100; &#1090;&#1072;&#1082;&#1091;&#1102; &#1110;&#1085;&#1110;&#1094;&#1099;&#1103;&#1083;&#1110;&#1079;&#1072;&#1094;&#1099;&#1102; (&#1084;&#1077;&#1085;&#1072;&#1074;&#1110;&#1090;&#1072; &#1075;&#1101;&#1090;&#1082;&#1072;&#1103; &#1073;&#1099;&#1083;&#1072; &#1089;&#1082;&#1072;&#1088;&#1099;&#1089;&#1090;&#1072;&#1085;&#1072;, &#1082;&#1072;&#1073; &#1089;&#1090;&#1074;&#1072;&#1088;&#1099;&#1094;&#1100; &#1075;&#1088;&#1072;&#1092;&#1110;&#1082; &#1085;&#1072; &#1074;&#1110;&#1076;&#1101;&#1086;): 

NSNumberFormatter *numberFormatter = [NSNumberFormatter new];
[numberFormatter setNumberStyle:NSNumberFormatterDecimalStyle];
[numberFormatter setMinimumFractionDigits:0];
[numberFormatter setMaximumFractionDigits:0];
	
self.graphView.yValuesFormatter = numberFormatter;

NSDateFormatter *dateFormatter = [NSDateFormatter new];
[dateFormatter setTimeStyle:NSDateFormatterNoStyle];
[dateFormatter setDateStyle:NSDateFormatterShortStyle];
	
self.graphView.xValuesFormatter = dateFormatter;
	
[dateFormatter release];	
[numberFormatter release];

self.graphView.backgroundColor = [UIColor blackColor];
	
self.graphView.drawAxisX = YES;
self.graphView.drawAxisY = YES;
self.graphView.drawGridX = YES;
self.graphView.drawGridY = YES;
	
self.graphView.xValuesColor = [UIColor whiteColor];
self.graphView.yValuesColor = [UIColor whiteColor];
	
self.graphView.gridXColor = [UIColor whiteColor];
self.graphView.gridYColor = [UIColor whiteColor];
	
self.graphView.drawInfo = NO;
self.graphView.info = @&quot;Load&quot;;
self.graphView.infoColor = [UIColor whiteColor];&#1055;&#1088;&#1099; &#1085;&#1077;&#1072;&#1073;&#1093;&#1086;&#1076;&#1085;&#1072;&#1089;&#1094;&#1110; &#1072;&#1073;&#1085;&#1072;&#1074;&#1110;&#1094;&#1100; &#1076;&#1072;&#1076;&#1079;&#1077;&#1085;&#1099;&#1103;, &#1079;&#1088;&#1072;&#1073;&#1110;&#1094;&#1077; &#1090;&#1072;&#1082;&#1110; &#1074;&#1099;&#1082;&#1083;&#1110;&#1082;: 

[self.graphView reloadData];</description>
      <homepage_url>http://code.google.com/p/s7graphview/</homepage_url>
      <download_url></download_url>
      <url_name>s7graphview</url_name>
      <medium_logo_url>no_logo.png</medium_logo_url>
      <small_logo_url>no_logo_32.png</small_logo_url>
      <user_count>2</user_count>
      <average_rating></average_rating>
      <rating_count>0</rating_count>
      <review_count>0</review_count>
      <analysis_id>5554887</analysis_id>
      <tags>
        <tag>uiview</tag>
        <tag>iphone</tag>
        <tag>plot</tag>
        <tag>graph</tag>
      </tags>
      <analysis>
        <id>5554887</id>
        <url>http://www.ohloh.net/analyses/5554887.xml</url>
        <project_id>456348</project_id>
        <updated_at>2012-01-05T14:07:47Z</updated_at>
        <logged_at>2012-01-05T14:07:44Z</logged_at>
        <min_month>2009-09-01T00:00:00Z</min_month>
        <max_month>2009-09-01T00:00:00Z</max_month>
        <twelve_month_contributor_count>0</twelve_month_contributor_count>
        <total_code_lines>285</total_code_lines>
        <factoids>
        </factoids>
        <languages graph_url="http://www.ohloh.net/p/s7graphview/analyses/5554887/languages.png">
          <language color="C7932C" percentage="93" id="16">
Objective-C          </language>
          <language color="FF8F00" percentage="7" id="42">
C          </language>
        </languages>
        <main_language_id>16</main_language_id>
        <main_language_name>Objective-C</main_language_name>
      </analysis>
      <licenses>
        <license>
          <name>bsd</name>
          <nice_name>BSD 4-clause (University of California-Specific)</nice_name>
        </license>
      </licenses>
    </project>
  </result>
</response>
