<?xml version="1.0" encoding="UTF-8"?>
<response>
  <status>success</status>
  <result>
    <project>
      <id>597604</id>
      <name>Intro C# Book</name>
      <url>http://www.ohloh.net/p/introcsharpbook.xml</url>
      <html_url>http://www.ohloh.net/p/introcsharpbook</html_url>
      <created_at>2012-04-28T21:40:37Z</created_at>
      <updated_at>2013-07-15T08:09:52Z</updated_at>
      <description>&#1050;&#1085;&#1080;&#1075;&#1072; &quot;&#1042;&#1098;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086; &#1089;&#1098;&#1089; C#&quot;

&#1041;&#1077;&#1079;&#1087;&#1083;&#1072;&#1090;&#1085;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072; &#1079;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1080; &#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086; &#1079;&#1072; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1097;&#1080;. &#1050;&#1085;&#1080;&#1075;&#1072;&#1090;&#1072; &#1077; &#1089; &#1086;&#1090;&#1074;&#1086;&#1088;&#1077;&#1085; &#1082;&#1086;&#1076; &#1080; &#1080;&#1084;&#1072; &#1079;&#1072; &#1094;&#1077;&#1083; &#1076;&#1072; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080; &#1092;&#1091;&#1085;&#1076;&#1072;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072; &#1085;&#1072; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1097;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1089;&#1090;&#1080; &#1073;&#1077;&#1079; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090; &#1077;&#1079;&#1080;&#1082;&#1072; &#1079;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;. &#1058;&#1086;&#1074;&#1072; &#1077; &#1082;&#1085;&#1080;&#1075;&#1072; &#1079;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1080; &#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086;, &#1072; &#1085;&#1077; &#1082;&#1085;&#1080;&#1075;&#1072; &#1079;&#1072; C#! &#1054;&#1090; &#1085;&#1077;&#1103; &#1097;&#1077; &#1085;&#1072;&#1091;&#1095;&#1080;&#1090;&#1077; &#1092;&#1091;&#1085;&#1076;&#1072;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1085;&#1080;&#1090;&#1077; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1080; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086;, &#1073;&#1077;&#1079; &#1082;&#1086;&#1080;&#1090;&#1086; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1076;&#1072; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090;&#1077; &#1089;&#1086;&#1092;&#1090;&#1091;&#1077;&#1088;&#1077;&#1085; &#1080;&#1085;&#1078;&#1077;&#1085;&#1077;&#1088;. &#1050;&#1085;&#1080;&#1075;&#1072;&#1090;&#1072; &#1077; &#1085;&#1072; &#1073;&#1098;&#1083;&#1075;&#1072;&#1088;&#1089;&#1082;&#1080; &#1077;&#1079;&#1080;&#1082; &#1080; &#1089;&#1077; &#1088;&#1072;&#1079;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1074;&#1072; &#1073;&#1077;&#1079;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086; &#1074; &#1077;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1077;&#1085; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1080; &#1085;&#1072; &#1094;&#1077;&#1085;&#1072;&#1090;&#1072; &#1085;&#1072; &#1093;&#1072;&#1088;&#1090;&#1080;&#1103;&#1090;&#1072; &#1074; &#1093;&#1072;&#1088;&#1076;&#1091;&#1077;&#1088;&#1085;&#1080;&#1103; &#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;. &#1054;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1077;&#1085; &#1091;&#1077;&#1073; &#1089;&#1072;&#1081;&#1090;: http://www.introprogramming.info. &#1050;&#1085;&#1080;&#1075;&#1072;&#1090;&#1072; &#1077; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1077;&#1085; &#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082; &#1074; &#1082;&#1091;&#1088;&#1089;&#1086;&#1074;&#1077;&#1090;&#1077; &#1087;&#1086; &#1074;&#1098;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086; &#1074; &#1040;&#1082;&#1072;&#1076;&#1077;&#1084;&#1080;&#1103;&#1090;&#1072; &#1085;&#1072; &#1058;&#1077;&#1083;&#1077;&#1088;&#1080;&#1082; &#1079;&#1072; &#1089;&#1086;&#1092;&#1090;&#1091;&#1077;&#1088;&#1085;&#1086; &#1080;&#1085;&#1078;&#1077;&#1085;&#1077;&#1088;&#1089;&#1090;&#1074;&#1086;.</description>
      <homepage_url>http://www.introprogramming.info</homepage_url>
      <download_url>http://www.introprogramming.info/intro-csharp-book/</download_url>
      <url_name>introcsharpbook</url_name>
      <medium_logo_url>http://cloud.ohloh.net/attachments/15216/dotnet_med.png</medium_logo_url>
      <small_logo_url>http://cloud.ohloh.net/attachments/15216/dotnet_small.png</small_logo_url>
      <user_count>2</user_count>
      <average_rating></average_rating>
      <rating_count>0</rating_count>
      <review_count>0</review_count>
      <analysis_id>14637047</analysis_id>
      <tags>
        <tag>introcsharpbook</tag>
        <tag>algorithms</tag>
        <tag>csharp</tag>
        <tag>software</tag>
        <tag>programming</tag>
        <tag>dotnet</tag>
        <tag>data-structures</tag>
        <tag>nakov</tag>
      </tags>
      <analysis>
        <id>14637047</id>
        <url>http://www.ohloh.net/analyses/14637047.xml</url>
        <project_id>597604</project_id>
        <updated_at>2013-07-15T08:09:52Z</updated_at>
        <logged_at>2013-07-15T08:09:11Z</logged_at>
        <min_month>2009-11-01T00:00:00Z</min_month>
        <max_month>2013-07-01T00:00:00Z</max_month>
        <twelve_month_contributor_count>4</twelve_month_contributor_count>
        <total_code_lines>7905</total_code_lines>
        <factoids>
          <factoid type="FactoidActivityIncreasing">
Increasing Y-O-Y development activity          </factoid>
          <factoid type="FactoidTeamSizeAverage">
Average size development team          </factoid>
          <factoid type="FactoidAgeOld">
Well-established codebase          </factoid>
          <factoid type="FactoidCommentsAverage">
Average number of code comments          </factoid>
        </factoids>
        <languages graph_url="http://www.ohloh.net/p/introcsharpbook/analyses/14637047/languages.png">
          <language color="A4007E" percentage="88" id="6">
JavaScript          </language>
          <language color="47A400" percentage="6" id="1">
HTML          </language>
          <language color="FF1A00" percentage="6" id="4">
CSS          </language>
          <language color="A40011" percentage="&lt;1" id="12">
Ruby          </language>
        </languages>
        <main_language_id>6</main_language_id>
        <main_language_name>JavaScript</main_language_name>
      </analysis>
      <licenses>
        <license>
          <name>mit</name>
          <nice_name>MIT License</nice_name>
        </license>
      </licenses>
    </project>
  </result>
</response>
